Revit 2024 API
TransformWithBoundary Class
 This class contains the transform from model space to projection space for a view and the boundary in model space in which the transform is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public class TransformWithBoundary : IDisposable
Visual Basic
Public Class TransformWithBoundary _
	Implements IDisposable
Visual C++
public ref class TransformWithBoundary : IDisposable
Remarks
 Use the model-to-projection transform returned by GetModelToProjectionTransform() to transform model points to the view's projection space. The model-to-projection transform is only valid for points in 3D model space that that can be seen through the 2D boundary returned by GetBoundary(), when looking in the direction of [!:View.ViewDirection].
 For views that are placed on sheets, you can combine the View's model-to-projection transform and the Viewport's projection-to-sheet transform to transform model points to sheet space:
sheetXYZ = projectionToSheetTransform * modelToProjectionTransform * modelXYZ
 Model space is the global 3D coordinate space in which the 3D geometry of the model lives.
 View projection space is the 3D Euclidean space with a coordinate system such that X and Y are horizontal and vertical directions in the view projection plane and Z is the cross product of X and Y. Distances in the projection space are the same as would be measured on paper if the view is printed without additional scaling.
 Sheet space is the coordinate space of one sheet. This is the space in which viewports and titleblocks are arranged on the sheet.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TransformWithBoundary
See Also
TransformWithBoundary Members
Autodesk.Revit.DB Namespace